IdeaRS.OpenModel.CrossSection.CrossSectionThermalAttribute
Cross-section thermal attribute
This sample shows how to create thermal attributes on cross-section.
//Creating the model
OpenModel openModel = new OpenModel();
Set thermal definition - on component 0,
CrossSectionThermalAttribute thermalAttr = new CrossSectionThermalAttribute();
thermalAttr.Element = new ReferenceElement(css);
CrossSectionComponentThermalData thermalComp = new CrossSectionComponentThermalData();
thermalComp.MoistureContent = 0.015;
thermalComp.ThermalConductivityLimit = ThermalConductivityLimit.Lower;
thermalComp.ComponentIndex = 0;
thermalAttr.Components.Add(thermalComp);
openModel.AddObject(thermalAttr);

IdeaRS.OpenModel.CrossSection.CrossSectionThermalAttribute.#ctor
Constructor

IdeaRS.OpenModel.CrossSection.CrossSectionThermalAttribute.Components
List of components